{
    "documentation": {
        "version": 1.0,
        "control_panel": {
            "title": "Control Panel",
            "description": "The ABR Control Panel handles stimulus presentation and acquisition of ABR data.",
            "type": "figure",
            "components": {
                "menu": {
                    "stay_on_top": {
                        "tag": "StayonTopMenu",
                        "title": "Keep Control Panel on Top",
                        "description": "Keep the Control Panel on top of all other windows.  Note that this feature may not work in the current version... sorry!",
                        "type": "menu"
                    },
                    "asio_settings": {
                        "tag": "ASIOSettingsMenu",
                        "title": "Adjust ASIO Settings",
                        "description": "Launch external ASIO settings utility.  The sampling rate and frame length are automatically set from Matlab so you should not have to adjust any settings in your ASIO utility directly.  Some setups may require customization.",
                        "type": "menu"
                    },
                    "audio_device": {
                        "tag": "SelectAudioDeviceMenu",
                        "title": "Select Audio Device",
                        "description": "Select which audio device connected to your computer to use for stimulation and acquisition.  Currently, this must be the same device.  The ABR Control Panel will remember your selection unless something about your sound card changes.",
                        "type": "menu"
                    },
                    "audio_channels": {
                        "tag": "SetupAudioChannelsMenu",
                        "title": "Define Audio Channels",
                        "description": "Use this to define which channels on your sound card should be used for audio output (to the speaker), signal input (bioamplifier input), loop-back timing input and output.",
                        "type": "menu"
                    }
                },
                "configure": {
                    "tag": "ConfigTab",
                    "type": "tab",
                    "title": "Configuration Panel",
                    "description": "Select the files to run an experiment.  Save/Load a Config file to quickly access the current experiment setup.\n\nchar(176) All file paths and parameter values will be restored when loading a configuration file.",
                    "config_file": {
                        "tag": "ConfigFileDD",
                        "title": "Config File",
                        "description": "Selecting a configuration file will update all other fields and variables in this GUI.",
                        "type": "dropdown"
                    },
                    "schedule_file": {
                        "tag": "ConfigScheduleDD",
                        "title": "Schedule File",
                        "description": "Choose a schedule to control stimulus presentation.",
                        "type": "dropdown"
                    },
                    "calibration_file": {
                        "tag": "CalibrationDD",
                        "title": "Calibration File",
                        "description": "Select a calibration file associated with the stimulus in the selected schedule",
                        "type": "dropdown"
                    },
                    "data_output_file": {
                        "tag": "OutputFileDD",
                        "title": "Data Output File",
                        "description": "Update the data output filename.  Determines where to write the ABR data.  Use the dropdown box to select a different file to write to in the same directory.",
                        "type": "dropdown"
                    },
                    "data_output_directory": {
                        "tag": "OutputPathDD",
                        "title": "Data Output Directory",
                        "description": "Select a directory to output the ABR data.  Use the dropdown to select a recently used directory.",
                        "type": "dropdown"
                    }
                },
                "control": {
                    "tag": "ControlTab",
                    "title": "Control Panel",
                    "description": "Main control panel for starting, stopping, and parameterizing ABR recording.",
                    "num_sweeps": {
                        "tag": "SweepCountSpinner",
                        "title": "Number of Sweeps",
                        "description": "Number of sweeps to present before moving to the next row in the schedule.",
                        "type": "numeric",
                        "value": 1024,
                        "unit": "none"
                    },
                    "sweep_rate": {
                        "tag": "SweepRateHzSpinner",
                        "title": "Sweep Rate",
                        "description": "Frequency at which to present stimuli.",
                        "type": "numeric",
                        "value": 21.1,
                        "unit": "Hz"
                    },
                    "num_repetitions": {
                        "tag": "NumRepetitionsSpinner",
                        "title": "Number of Repetitions",
                        "description": "Number of times to present each row before moving on",
                        "type": "numeric",
                        "value": 1,
                        "unit": "none"
                    },
                    "sweep_duration": {
                        "tag": "SweepDurationSpinner",
                        "title": "Sweep Duration",
                        "description": "Duration of the response waveform",
                        "type": "numeric",
                        "value": 10,
                        "unit": "ms"
                    },
                    "advance_on": {
                        "tag": "ControlAdvCriteriaDD",
                        "title": "Advance Schedule Criterion",
                        "description": "Criterion to advance to the next row in the schedule.  Click the \"Define\" option to select a custom function.",
                        "type": "dropdown",
                        "unit": "none"
                    },
                    "advance": {
                        "tag": "ControlAdvanceButton",
                        "title": "Advance Schedule Row",
                        "description": "Click to advance to the next schedule row (or next sweep if # Repetitions > 1).",
                        "type": "momentary_button"
                    },
                    "repeat": {
                        "tag": "ControlRepeatButton",
                        "title": "Repeat Schedule Row",
                        "description": "Click to repeat the current stimulus presentation.  Click the button again to deactivate.",
                        "type": "state_button"
                    },
                    "pause": {
                        "tag": "ControlPauseButton",
                        "title": "Pause Acquisition",
                        "description": "Click to toggle pause/play",
                        "type": "state_button"
                    },
                    "acquire": {
                        "tag": "ControlAcquisitionSwitch",
                        "title": "Start/Stop Acquisition",
                        "description": "Use to toggle acquisition of ABR.",
                        "type": "state_button"
                    }
                },
                "acq_filter": {
                    "tag": "AcqFilterTab",
                    "title": "Acquisition Filter Panel",
                    "description": "Digital acquisition filters.  These filters are optional and can be disabled using the corresponding buttons to the right.",
                    "filter": {
                        "tag": [
                            "FilterHPFcEditField",
                            "FilterLPFcEditField"
                        ],
                        "description": "Set high-pass and low-pass frequency corner of a digital acquisition filter.  The filter can be enabled/disabled using the switch.",
                        "type": "numeric",
                        "unit": "Hz",
                        "value": "[10, 3000]"
                    },
                    "notch_filter": {
                        "tag": "FilterEnableSwitch",
                        "description": "Set digital notch-band filter for line noise rejection.",
                        "type": "numeric",
                        "unit": "Hz",
                        "value": "Disabled"
                    }
                },
                "utilities": {
                    "title": "Utilities Panel",
                    "description": "Brings you to other relevant utilities."
                }
            }
        },
        "calibration": {
            "tag": "CalibrationFigure",
            "type": "figure",
            "title": "Calibration Utility",
            "description": "Use this utility to calibrate sound stimuli such as tones, noises, or clicks.  You will need to hook up a microphone and preamplifier to the acquisition channel of your sound card (typically the input from your bioamplifier).",
            "components": {
                "hardware": {
                    "tag": "HardwarePanel",
                    "type": "panel",
                    "title": "Hardware Setup",
                    "description": "Select your audio device and sampling rate.\n\nchar(176) The audio device and sampling rate will be the same used to run the ABR.\n\nchar(176) The sound card will typically be some version of ASIO.\n\nchar(176) You will most likely set the sampling rate to its maximum value, unless this results in program crashes or other instability"
                },
                "micsensitivity": {
                    "tag": "MicSensitivityPanel",
                    "type": "panel",
                    "title": "Microphone Sensitivity",
                    "description": "In order to properly calibrate the sound level of a speaker, we need to determine the sensitivity of a microphone and amplification system.  You can do this using one of two methods:\n\n1) *Recommended* Use a piston phone or electronic speaker with a known sound level to measure the sensitivity of your microphone and amplifier.  Enter the frequency of the sound source and it's sound level (dB SPL) and click the Sample button.  Inspect the resulting time- and frequency-domain plots for a clean sinusoid at the specified frequency.\n\n2) Enter the sensitivity from the data that came with the microphone which is typically some number of mV at 1 Pascal.  Since 1 Pascal is equal to 94 dB SPL, enter 94 in the sound level field and the mV in the measured voltage field (ignore the frequency field).  Note that you will need to adjust the measured voltage value based on any additonal amplification in the microphone system; eg. multiply by 10 for 20 dB amplification."
                },
                "stimulus": {
                    "tag": "StimulusPanel",
                    "type": "panel",
                    "title": "Stimulus Selection",
                    "description": "Select the stimulus type from the dropdown list and click Modify to adjust the stimulus parameters to your needs.\n\nchar(176) Tone stimuli are calibrated using interpolation of frequency so you will need to set the frequency parameter to characterize your speaker's transfer function.\n\nchar(176) Typically, you will set the parameter to cover the range from the lowest frequency you want to present to just below the Nyquist rate = Sampling Rate/2.\n\nchar(176) Other stimulus types are calibrated using a look-up table, so you will need to enter the parameters of stimuli you will be using."
                },
                "calibrate": {
                    "tag": "CalibratePanel",
                    "type": "panel",
                    "title": "Run Calibration",
                    "description": "First, specify a sound level, the Norm Level, as a target for the calibrated stimulus.  This is often the maximum sound level you intend to present.  It is possible that the voltage required to produce this sound level will be too high for your sound card to produce (>1 V).  If this is the case, then you will need to provide additional amplification and recalibrate.\n\nchar(176) Click Run to begin.\n\nchar(176) The stimuli will be played through entirely and once finished the results will be plotted.  The stimuli will then be played through a second time at the calibrated voltage.  The results will be plotted again and should be flat on the Norm Level line.\n\nchar(176) You will be prompted to save the calibration file once the calibration procedure has completed."
                }
            }
        },
        "schedule_design": {
            "tag": "ScheduleDesign",
            "type": "figure",
            "title": "Stimulus Schedule Design",
            "description": "The Stimulus Schedule Design utility is used to parameterize sound stimuli to be used during an ABR recording.  The result will be a new Schedule that will be used for controlling stimulus presentation during an ABR recording.\n\n1) Set the sampling rate to be used by your system (generally higher is better if your system supports it) by clicking the Options -> Stimulus Sampling Rate menu.\n\n2) Select the signal type you would like to generate.  Select from Tone, Noise, Click, or File.\n\n3) Modify the parameter values by entering individual numbers or a valid Matlab expression.  Note the units specified in the Property column.  A valid Matlab expression is one that will result in a row vector (1xN).  All of the following will have the same results: [1 2 3 4 5]; 1:5;  linspace(1,5,5);  Another useful function is octaves (see help octaves).\n\n4) Click the Compile button to generate a schedule.  This will launch the Schedule utility with all of the defined stimulus parameters that will be used for controlling stimulus presentation during an ABR recording.\n\nchar(176)  The Schedule Design can be saved or reloaded using the File menu.",
            "components": {}
        },
        "schedule": {
            "tag": "Schedule",
            "type": "figure",
            "title": "Stimulus Schedule",
            "description": "The Stimulus Schedule enables the user to control which stimulus parameters and the order in which they are presented during an ABR session.  Each row in the schedule is a single stimulus to be presented.  The checkbox in the first column of each row determines if that stimulus will be presented.  Unchecked rows will be skipped.  You can check/uncheck rows before or during an ABR recording.  The stimuli will always be presented from the top of the schedule to bottom.",
            "components": {
                "SortOnColumn": {
                    "tag": "SortOnColumn",
                    "type": "momentary_button",
                    "title": "Sort on Column",
                    "description": "Sort on Column - Select any cell in a column and click the Sort on Column button to sort numbers in descending order.  Clicking the button a second time will sort the numbers in ascending order.  This sorting is maintained so clicking a cell a second column and clicking this button will perform a simple hierarchical sorting."
                }
            }
        },
        "trace_organizer": {
            "tag": "TraceOrganizer",
            "type": "figure",
            "title": "Trace Organizer",
            "description": "Trace Organizer Commands\n\nLeft-Click:    Select a trace - Click background to deselect all traces\nCtrl+Left-Click:    Select one or more traces\nShift+Left-Click:    Select range of traces\nCtrl+Shift+Left-Click:    Select all traces within a group\n\n\na:   Select all traces\ns:   Save current Trace Organizer\no:   Open a Trace Organizer\nf:    Export figure as an image (jpg,tif,etc.) or vector file (pdf,eps,etc.)\n\n\nk/m:   Increase/Decrease trace spacing\nj/n:     Increase/Decrease trace amplitude\ni:        Equalize trace spacing\nv:       Overlap selected traces\np:       Popout currently selected trace(s)\n\n\nc:     Clear all traces\nd:     Delete selected traces\ne:     Export selected traces to the workspace\ng/u:  Group/Ungroup selected traces\np:     Open selected traces in new Trace Organizer Window\nv:     Overlap selected traces\nq:     Change the color of the selected traces\nh:     Toggle visibility of selected or all trace labels"
        }
    }
}